stress_test_result.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Finished 7466 requests


Server Software:        WSGIServer/0.2
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /
Document Length:        535 bytes

Concurrency Level:      2
Time taken for tests:   60.019 seconds
Complete requests:      7466
Failed requests:        0
Total transferred:      6980710 bytes
HTML transferred:       3994310 bytes
Requests per second:    124.39 [#/sec] (mean)
Time per request:       16.078 [ms] (mean)
Time per request:       8.039 [ms] (mean, across all concurrent requests)
Transfer rate:          113.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0      16
Processing:    12   16   3.7     15      68
Waiting:       11   15   3.5     15      67
Total:         12   16   3.7     15      68

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     17
  80%     17
  90%     19
  95%     21
  98%     24
  99%     31
 100%     68 (longest request)